# ¿Que es Pandas?

In [2]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

# ¿Diferencias entre Series y DataFrames?

In [3]:
obj = pd.Series([2,1,-7,3])

In [4]:
obj

0    2
1    1
2   -7
3    3
dtype: int64

In [ ]:
obj.index

In [8]:
obj2 = pd.Series([2,1,-7,3], index=['a','b','c','d'])

In [ ]:
obj2

In [9]:
obj2['b']

1

In [11]:
obj2[obj2>1]

a    2
d    3
dtype: int64

In [12]:
obj2*2

a     4
b     2
c   -14
d     6
dtype: int64

In [14]:
'a' in obj2

True

**Uso de Diccionarios con Series**

In [15]:
diccionario = {'Peras':3,'Manzanas':2,'Naranjas':4}

In [16]:
diccionario

{'Manzanas': 2, 'Naranjas': 4, 'Peras': 3}

In [17]:
obj3 = pd.Series(diccionario)
obj3

Peras       3
Manzanas    2
Naranjas    4
dtype: int64

In [19]:
frutas = {'Cerezas','Peras','Manzanas','Naranjas'}
obj4 = pd.Series(diccionario,index=frutas)

In [20]:
obj4

Naranjas    4.0
Cerezas     NaN
Manzanas    2.0
Peras       3.0
dtype: float64

In [21]:
pd.isnull(obj4)

Naranjas    False
Cerezas      True
Manzanas    False
Peras       False
dtype: bool

In [22]:
pd.notnull(obj4)

Naranjas     True
Cerezas     False
Manzanas     True
Peras        True
dtype: bool

In [23]:
if pd.isnull(obj4[1]):
  print("Elemento 0 es nulo")

Elemento 0 es nulo

# ¿Que es un dataframe?

# DataFrames en Python

In [30]:
data = {'id':[1,2,3,4,5],'name':['Pablo','Pedro','Juan','Cecilia','Maria'],'total buy':[23.4,34.5,99.2,50.1,12]}

In [31]:
data

{'id': [1, 2, 3, 4, 5],
 'name': ['Pablo', 'Pedro', 'Juan', 'Cecilia', 'Maria'],
 'total buy': [23.4, 34.5, 99.2, 50.1, 12]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

   id     name  total buy
0   1    Pablo       23.4
1   2    Pedro       34.5
2   3     Juan       99.2
3   4  Cecilia       50.1
4   5    Maria       12.0

In [35]:
df.name

0      Pablo
1      Pedro
2       Juan
3    Cecilia
4      Maria
Name: name, dtype: object

In [36]:
df.columns

Index(['id', 'name', 'total buy'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df['total buy']

0    23.4
1    34.5
2    99.2
3    50.1
4    12.0
Name: total buy, dtype: float64

In [39]:
df.head(10)

   id     name  total buy
0   1    Pablo       23.4
1   2    Pedro       34.5
2   3     Juan       99.2
3   4  Cecilia       50.1
4   5    Maria       12.0

In [41]:
location = ['Madrid','Valencia','Canarias','Vigo','Barcelona']

In [42]:
df['location'] = location

In [43]:
df

   id     name  total buy   location
0   1    Pablo       23.4     Madrid
1   2    Pedro       34.5   Valencia
2   3     Juan       99.2   Canarias
3   4  Cecilia       50.1       Vigo
4   5    Maria       12.0  Barcelona